Процедура Алгоритм() Экспорт

	Для индекс = 1 По 1000000 Цикл
		
	КонецЦикла;
	
	// 1. Пытаемся получить обсуждение, если оно существует
	Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение("ФП");
	
	Если Обсуждение = Неопределено Тогда
		Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
		Обсуждение.Отображаемое = Истина;
		Обсуждение.Ключ = "ФП";
		Обсуждение.Заголовок = "Фоновые процессы";
		Обсуждение.Участники.Добавить(СистемаВзаимодействия.СтандартныеПользователи.ВсеПользователиПриложения);
		Обсуждение.Записать();
	КонецЕсли;
	
	Сообщение = СистемаВзаимодействия.СоздатьСообщение(Обсуждение.Идентификатор);
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени("Система");
	Попытка
		Сообщение.Автор = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ПользовательИБ.УникальныйИдентификатор);
	Исключение
		ПользовательСВ = СистемаВзаимодействия.СоздатьПользователя(ПользовательИБ);
		ПользовательСВ.Записать();
		Сообщение.Автор = ПользовательСВ.Идентификатор;
	КонецПопытки;
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Сообщение.Получатели.Добавить(СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ПользовательИБ.УникальныйИдентификатор));
	
	Сообщение.Текст = "Выполнено: " + ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание().ИмяМетода;
	
	Сообщение.Записать();
	
КонецПроцедуры

