
&НаКлиенте
Процедура ВыбратьСхему(Команда)

	ОбработчикВыбора = Новый ОписаниеОповещения("ПослеВыбораСхемы", ЭтотОбъект);
	ОткрытьФорму("Отчет.УО_УниверсальныйОтчет.Форма.ВыборСхемы",,ЭтотОбъект,,,,ОбработчикВыбора);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСхемы(Результат, ДопПараметры) Экспорт
	
	// Блок проверки возможности исполнения алгоритма действия
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;

	// Блок алгоритма действия
	Закрыть();
    	// Открытие нового экземпляра этой же формы
	ОткрытьФорму("Отчет.УО_УниверсальныйОтчет.ФормаОбъекта", 
		Новый Структура("КлючНазначенияИспользования", Результат)); // что за параметр?
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры
