#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ЗаписатьДанные(Параметры.РегистрацияСхемы, ВыбранноеЗначение);
	Оповестить("ЗагруженаСхема", Параметры.РегистрацияСхемы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДанные(Знач РегистрацияСхемы, Знач Схема)
	
	РегистрыСведений.УО_ХранилищеСхем.ДобавитьСхему(РегистрацияСхемы,, Схема);

КонецПроцедуры

#КонецОбласти
