
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПроверитьСуществованиеСхемы(ПараметрКоманды);

	ПараметрыФормы = Новый Структура("КлючНазначенияИспользования, КонтекстныйРежим",
							Строка(ПараметрКоманды.УникальныйИдентификатор()),
							Истина);
	
	ОткрытьФорму("Отчет.УО_УниверсальныйОтчет.Форма", 
					ПараметрыФормы, 
					ПараметрыВыполненияКоманды.Источник, 
					ПараметрыВыполненияКоманды.Уникальность, 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Процедура ПроверитьСуществованиеСхемы(Знач РегистрацияСхемы)

	Если РегистрыСведений.УО_ХранилищеСхем.СхемаСуществует(РегистрацияСхемы) Тогда
		Возврат;
	КонецЕсли;
	
	Если РегистрацияСхемы.ЭтоГруппа Тогда
		ТекстСообщения = "Нельзя открыть отчет для группы отчетов";
	Иначе
		ТекстСообщения = "Нельзя открыть отчет без схемы";
	КонецЕсли;

	//Goto
	ВызватьИсключение ТекстСообщения;

КонецПроцедуры