
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// даже если св-во ЭтоГруппа не отображается, можно обратиться т.к. стоит флаг Использовать всегда
	Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка(ВыбраннаяСтрока));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НавигационнаяСсылка(Знач РегистрацияСхемы) // передаем в одну сторону
	
	// программно вызываем команду
	Возврат ПолучитьНавигационнуюСсылку(Метаданные.ОбщиеКоманды.УО_ОткрытьОтчет,
		РегистрацияСхемы);
		
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ЗагруженаСхема" Тогда
		ОтобразитьИзменениеДанных(Параметр, ВидИзмененияДанных.Изменение);	
	КонецЕсли;

КонецПроцедуры
