
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ОбновитьпараметрыФункциональныхОпций();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьпараметрыФункциональныхОпций();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьпараметрыФункциональныхОпций()
	
	УстановитьПараметрыФункциональныхОпцийФормы(
		Новый Структура("Клиент", ЭтотОбъект.Объект.Контрагент));
	
КонецПроцедуры