
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
	Поле = ПолучитьЗначениеРасшифровки(Расшифровка, "Товар");
	
	Если ТипЗнч(Поле) = Тип("СправочникСсылка.Товары") Тогда

		ПоказатьЗначение(Неопределено, Поле);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРасшифровки(Расшифровка, ИмяПоля)
	
	ДанныеРасшифровкиКомпоновки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	ПоляРасшифровки = ДанныеРасшифровкиКомпоновки.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	НайденоеПоле = ПоляРасшифровки.Найти(ИмяПоля);
	
	Если НайденоеПоле = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат НайденоеПоле.Значение;
	КонецЕсли;

КонецФункции