
&НаКлиенте
Процедура ПутьКИсточникуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТипИсточникаСтр = "" + Объект.ТипИсточника;
	
	Если ТипИсточникаСтр = "Файл" Тогда
		ВыбратьФайл();
	ИначеЕсли ТипИсточникаСтр = "Макет" Тогда
		ВыбратьМакет();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ТипИсточника.Доступность = Объект.Родитель.ТипИсточника.Пустая();
	
КонецПроцедуры

&НаКлиенте
АСИНХ Процедура ВыбратьФайл()

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выбрать файл схемы";
	Диалог.Фильтр = "Файл схемы компоновки данных|*.xml";
	Диалог.Каталог = Ждать КаталогДокументовАсинх();
	
	Ответ = Ждать Диалог.ВыбратьАсинх();
	
	Если Ответ <> Неопределено Тогда
		
		Объект.ПутьКИсточнику = Ответ.Получить(0);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМакет()
	
	ОткрытьФорму("РегистрСведений.УО_ДоступныеМакеты.Форма.ФормаВыбора",,ЭтотОбъект,,,, Новый ОписаниеОповещения("ВыбратьМакетЗавершение", ЭтаФорма), );
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМакетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.ПутьКИсточнику = Результат;
	КонецЕсли;
	
КонецПроцедуры

